--set serveroutput on
/* Select Ayaat to update urdu translation in soorah, ayat order */
SELECT a.ayat_id, a.ayat_text, a.translation_urdu 
FROM ayat a,
     soorah s
WHERE a.soorah_id = s.soorah_id 
AND soorah_seq_no = 2
AND ayat_seq_no >=31
AND ayat_seq_no <= 40;
--
--Grab ayat_ids for PL/SQL Block for root letter based translation update
SELECT s.soorah_seq_no, '   vtran('||TO_CHAR(a.ayat_id)||') := '''';', a.ayat_seq_no, a.ayat_text
FROM kalimaat_ayat_xref x,
    ayat a,
    soorah s,
    kalimaat k,
    root_letter r,
    arabic_alphabet ar 
WHERE a.ayat_id = x.ayat_id
AND a.soorah_id = s.soorah_id
AND k.kalimaat_id = x.kalimaat_id
AND k.root_letter_id = r.root_letter_id
AND ar.arabic_alphabet_id = r.arabic_alphabet_id
AND a.translation_urdu IS NULL
AND ROWNUM <= 10
ORDER BY ar.alphabet_text, r.root_letter_seq_no, k.kalimah_seq_no, s.soorah_seq_no, a.ayat_seq_no;
--
/*Update Ayat with urdu translation */
DECLARE    
    TYPE t_tran IS TABLE OF VARCHAR2(2000) INDEX BY PLS_INTEGER;
    vtran t_tran;
    i NUMBER;
BEGIN
    /*Replace index by ayat_id and text by translation */
    vtran(1) := ('شروع اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے');
    vtran(2) := ('سب تعریفیں اللہ کے لۓ ہیں جو پالنے والا سارے جہاں کا');
    vtran(3) := ('بے حد مہربان نہایت رحم والا');
    vtran(4) := ('مالک روز جزا کا');
    vtran(5) := ('تیری ہی ہم بندگی کرتے ہیں اور تجھی سے مدد چاہتے ہیں');
    vtran(6) := ('بتلا ہم کو راہ سیدھی');
    vtran(7) := ('راہ ان لوگوں کی جن پر تو نے فضل فرمایا جن پر نہ تیرا غصہ ہوا اور نہ وہ گمراہ ہوۓ');
    vtran(8) := ('الم');
    vtran(9) := ('اس کتاب میں کوئ شک نہیں راہ بتلاتی ہے ڈرنے والوں کو');
    vtran(10) := ('جو کہ یقین کرتے ہیں بن دیکھی چیزوں کا اور قائم رکھتے ہیں نماز کو اور ہم نے روزی دی ہے ان کو اس میں سے خرچ کرتے ہیں');
    vtran(11) := ('اور وہ لوگ جو ایمان لاۓ اس پر کہ جو کچھ نازل ہوا تیری طرف اور اس پر کہ جو کچھ نازل ہوا تجھ سے پہلے اور آخرت کو وہ یقینی جانتے ہیں');
    vtran(12) := ('وہی لوگ ہیں ہدایت پر اپنے پروردگار کی طرف سے اور وہی ہیں مراد کو پہنچنے والے');
    vtran(13) := ('بیشک جو لوگ کافر ہو چکے برابر ہے ان کو تو ڈراۓ یا نہ ڈراۓ وہ ایمان نہ لائیں گے');
    vtran(14) := ('مہر کر دی اللہ نے ان کے دلوں پر اور ان کے کانوں پر اور ان کی آنکھوں پر پردہ ہے اور ان کے لۓ بڑا عذاب ہے');
    vtran(15) := ('اور لوگوں میں کچھ ایسے بھی ہیں جو کہتے ہیں ہم ایمان لاۓ اللہ پر اور دن قیامت پر اور وہ ہرگز مومن نہیں');
    vtran(16) := ('دغابازی کرتے ہیں اللہ سے اور ایمان والوں سے اور دراصل کسی کو دغا نہیں دیتے مگر اپنے آپ کو اور نہیں سوچتے');
    vtran(17) := ('ان کے دلوں میں بیماری ہے پھر بڑھا دی اللہ نے ان کی بیماری اور ان کے لۓ عذاب دردناک ہے اس بات پر کہ جھوٹ کہتے ہیں');
    vtran(18) := ('اور جب کہا جاتا ہے ان کو فساد نہ ڈالو ملک میں تو کہتے ہیں ہم تو اصلاح کرنے والے ہیں');
    vtran(19) := ('جان لو وہی ہیں خرابی کرنے والے لیکن نہیں سمچھتے');
    vtran(20) := ('اور جب کہا جاتا ہے ان کو ایمان لاؤ جس طرح ایمان لاۓ سب لوگ تو کہتے ہیں کیا ہم ایمان لائیں جس طرح ایمان لاۓ بیوقوف جان لو وہی ہیں بیوقوف لیکن نہیں جانتے');
    vtran(21) := ('اور جب ملاقات کرتے ہیں مسلمانوں سے تو کہتے ہیں ہم ایمان لے آۓ ہیں اور جب تنہا ہوتے ہیں اپنے شیطانوں کے پاس تو کہتے ہیں کہ بیشک ہم تمہارے ساتھ ہیں ہم تو ہنسی کرتے ہیں (يعنی مسلمانوں سے)');
    vtran(22) := ('اللہ ہنسی کرتا ہے ان سے اور ترقی دیتا ہے انکو ان کی سرکشی میں (اور) حالت یہ ہے کہ وہ عقل کے اندھے ہیں');
    vtran(23) := ('یہ وہی ہیں جنہوں نے مول لی گمراہی ہدایت کے بدلے سو نافع نہ ہوئ ان کی سوداگری اور نہ ہوۓ راہ پانے والے');
    vtran(24) := ('ان کی مثال اس شخص کی سی ہے جس نے آگ جلائی پھر جب روشن کر دیا آگ نے اس کے آس پاس کو تو زائل کر دی اللہ نے ان کی روشنی اور چھوڑا ان کو اندھیروں میں کہ کچھ نہیں دیکھتے');
    vtran(25) := ('بہرے ہیں گونگے ہیں اندھے ہیں سو وہ نہیں لوٹیں گے');
    vtran(26) := ('یا ان کی مثال ایسی ہے جیسے زور سے مینہ پڑ رہا ہو آسمان سے اس میں اندھیرے ہیں اور گرج اور بجلی دیتے ہیں انگلیاں اپنے کانوں میں مارے کڑک کے موت کے ڈر سے اور اللہ احاطہ کرنے والا ہے کافروں کا');
    vtran(27) := ('قریب ہے کہ بجلی اچک لے ان کی آنکھیں جب چمکتی ہے ان پر تو چلنے لگتے ہیں اس کی روشنی میں اور جب اندھیرا ہوتا ہے تو کھڑے رہ جاتے ہیں اور اگر چاہے اللہ تو لیجاۓ ان کے کان اور آنکھیں بیشک اللہ ہر چیز پر قادر ہے');
    vtran(28) := ('اے لوگو بندگی کرو اپنے رب کی جس نے پیدا کیا تم کو اور ان کو جو تم سے پہلے تھے تاکہ تم پرہیزگار بن جاؤ');
    vtran(29) := ('جس نے بنایا واسطے تمہارے زمین کو بچھونا اور آسمان کو چھت اور اتارا آسمان سے پانی پھر نکالے اس سے میوے تمھارے کھانے کے واسطے سو نہ ٹھراؤ کسی کو اللہ کے مقابل اور تم تو جانتے ہو');
    vtran(30) := ('اور اگر تم شک میں ہو اس کلام سے جو اتارا ہم نے اپنے بندے پر تو لے آؤ ایک سورت اس جیسی اور بلاؤ اس کو جو تمہارا مددگار ہو اللہ کے سوا اگر تم سچے ہو');
    vtran(31) := ('پھر اگر ایسا نہ کر سکو اور ہرگز نہ کر سکو گے تو ّپھر بچو اس آگ سے جس کا ایندھن آدمی اور پتھر ہیں تیار کی ہوئ ہے کافروں کے واسطے');
    vtran(32) := ('اور خشخبری دے ان لوگوں کو جو ایمان لاۓ اور اچھے کام کیۓ کہ ان کے واسطے باغ ہیں کہ بہتی ہیں ان کے نیچے نہریں جب ملے گا ان کو وہاں کا کوئ پھل کھانے کو تو کہیں گے یہ تو وہی ہے جو ملا تھا ہم کو اس سے پہلے اور دیۓ جائیں گے ان کو پھل ایک صورت کے اور ان کے لۓ وہاں عورتیں ہوں گی پاکیزہ اور وہ وہیں ہمیشہ رہیں گے');
    vtran(33) := ('بیشک اللہ شرماتا نہیں اس بات سے کہ بیان کرے کوئ مثال مچھر کی یا اس چیز کی جو اس سے بڑھ کر ہے سو جو لوگ مومن ہیں وہ یقیناً جانتے ہیں کہ یہ مثال ٹھیک ہے جو نازل ہوئ انکے رب کی طرف سے اور جو کافر ہیں سو کہتے ہیں کیا مطلب تھا اللہ کا اس مثال سے گمراہ کرتا ہے خداۓ تعالی اس مثال سے بہتیروں کو اور ہدایت کرتا ہے اس سے بہتیروں کو اور گمراہ نہیں کرتا اس مثل سے مگر بدکاروں کو');
    vtran(34) := ('جو توڑتے ہیں خدا کے معاہدے کو مضبوط کرنے کے بعد اور قطع کرتے ہیں اس چیز کو جس کو اللہ نے فرمایا ملانے کو اور فساد کرتے ہیں ملک میں وہی ہیں ٹوٹنے والے');
    vtran(35) := ('کس طرح کافر ہوتے ہو خداۓ تعالی سے حالانکہ تم بیجان تھے پھر جلایا تم کو پھر مارے گا تم کو پھر جلائے گا تم کو پھر اسی کی طرف لوٹاۓ جاؤ گے');
    vtran(36) := ('وہی ہے جس نے پیدا کیا تمہارے واسطے جو کچھ زمین میں ہے سب پھر قصد کیا آسمان کی طرف سو ٹھیک کر دیا انکو سات آسمان اور خدا تعالی ہر چیز سے خبردار ہے');
    vtran(37) := ('اور جب کہا تیرے رب نے فرشتوں کو کہ میں بنانیوالا ہوں زمین میں ایک نائب کہا فرشتوں نے کیا قائم کرتا ہے تو زمین میں اس کو جو فساد کرے اس میں اور خون بہاۓ اور ہم پڑھتے رہتے ہیں تیری خوبیاں اور یاد کرتے ہیں تیری پاک ذات کو فرمایا بیشک مجھ کو معلوم ہے جو تم نہیں جانتے');
    vtran(38) := ('اور سکھلا دیۓ اللہ نے آدم کو نام سب چیزوں کے پھر سامنے کیا ان سب چیزوں کو فرشتوں کے پھر فرمایا بتاؤ مجھ کو نام ان کے اگر تم سچے ہو');
    vtran(39) := ('بولے پاک ہے تو ہم کو معلوم نہیں مگر جتنا تو نے ہم کو سکھایا بیشک تو ہی ہے اصل جاننے والا حکمت والا');
    vtran(40) := ('فرمایا اے آدم بتا دے فرشتوں کو ان چیزوں کے نام پھر جب بتا دیۓ اس نے ان کے نام فرمایا کیا نہ کہا تھا میں نے تم کو کہ میں خوب جانتا ہوں چھپی ہوئ چیزوں آسمانوں کی اور زمین کی اور جانتا ہوں جو تم ظاہر کرتے ہو اور جو چھپاتے ہو');
    vtran(41) := ('اور جب ہم نے حکم دیا فرشتوں کو کہ سجدہ کرو آدم کو تو سب سجدہ میں گر پڑے مگر شیطان اس نے نہ مانا اور تکبر کیا اور تھا وہ کافروں میں');
    vtran(42) := ('اور ہم نے کہا اے آدم رہا کر تو اور تیری عورت جنت میں اور کھاؤ اس میں جو چاہو جہاں کہیں سے چاہو اور پاس مت جانا اس درخت کے پھر تم ہو جاؤ گے ظالم');
    vtran(43) := ('پھر ہلا دیا انکو شیطان نے اس جگہ سے پھر نکالا انکو اس عزت و راحت سے کہ جس میں تھے اور ہم نے کہا تم سب اترو تم سب ایک دوسرے کے دشمن ہو گے اور تمہارے واسطے زمین میں ٹھکانا ہے اور نفع اٹھانا ہے ایک وقت تک');
    vtran(44) := ('پھر سیکھ لیں آدم نے اپنے رب سے چند باتیں پھر متوجہ ہو گیا اللہ اس پر بیشک وہی ہے توبہ قبول کرنے والا مہربان');
    vtran(45) := ('ہم نے حکم دیا نیچے جاؤ یہاں سے تم سب پھر اگر تم کو پہنچے میری طرف سے کوئ ہدایت تو جو چلا میری ہدایت پر نہ خوف ہو گا ان پر اور نہ وہ غمگین ہوں گے');
    vtran(46) := ('اور جو لوگ منکر ہوۓ اور جھٹلایا ہماری نشانیوں کو وہ ہیں دوزخ میں جانے والے وہ اس میں ہمیشہ رہیں گے');
    vtran(47) := ('اے بنی اسرائیل یاد کرو میرے احسان جو میں نے تم پر کۓ اور تم پورا کرو میرا اقرار تو میں پورا کروں تمہارا اقرار اور مجھ ہی سے ڈرو');
    vtran(5789) := 'اور میوہ اور گھاس';
    vtran(102) := 'اور ہرگز آرزو نہ کریں گے موت کی کبھی بسبب ان گناہوں کے کہ بھیج چکے ہیں ان کے ہاتھ اور اللہ خوب جانتا ہے گنہگاروں کو';
    vtran(2812) := 'اے ایمان والو نہ چلو قدموں پر شیطان کے اور جو کوئ چلے گا قدموں پر شیطان کے سو وہ تو یہی بتلاۓ گا بیحیائ اور بری بات اور اگر نہ ہوتا اللہ کا فضل تم پر اور اس کی رحمت تو نہ سنورتا تم میں ایک شخص بھی کبھی ولیکن اللہ سنوارتا ہے جس کو چاہے اور اللہ سب کچھ سنتا جانتا ہے';
    vtran(615) := 'اور جو لوگ ایمان لاۓ اور عمل کیۓ اچھے ان کو ہم داخل کریں گے باغوں میں کہ جن کے نیچے بہتی ہیں نہریں رہا کریں ان میں ہی ہمیشہ وعدہ ہے اللہ کا سچا اور اللہ سے سچا کون ہے';
    vtran(662) := 'مگر راہ دوزخ کی رہا کریں اس میں ہمیشہ اور یہ اللہ پر آسان ہے';
    vtran(693) := 'بولے اے موسی ہم ہرگز نہ جاویں گے ساری عمر جب تک وہ رہیں گے اس میں سو تو جا اور تیرا رب اور تم دونوں لڑو ہم تو یہیں بیٹھے ہیں';
    vtran(788) := 'فرمایا اللہ نے یہ دن ہے کہ کام آوے گا سچوں کے ان کا سچ انکے لۓ ہیں باغ جن کے نیچے بہتی ہیں نہریں رہا کریں گے انہی میں ہمیشہ اللہ راضی ہوا ان سے اور وہ راضی ہوۓ اس سے یہی ہے بڑی کامیابی';
    vtran(1257) := 'رہا کریں ان میں مدام بیشک اللہ پاس بڑا ثواب ہے';
    vtran(1318) := 'سو اگر لے جاۓ تجھ کو اللہ کسی فرقہ کی طرف ان میں سے پھر اجازت چاہیں نکلنے کی تو تو کہہ دینا کہ تم ہرگز نہ نکلو گے میرے ساتھ کبھی اور نہ لڑو گے میرے ساتھ ہو کر کسی دشمن سے تم کو پسند آیا بیٹھ رہنا پہلی بار سو بیٹھے رہو پیچھے رہنے والوں کے ساتھ';
    vtran(1335) := 'اور جو لوگ قدیم ہیں سب سے پہلے ہجرت کرنے والے اور مدد کرنے والے اور جو انکے پیرو ہوۓ نیکی کے ساتھ اللہ راضی ہوا ان سے اور وہ راضی ہوۓ اس سے اور تیار کر رکھیں ہیں واسطے انکے باغ کہ بہتی ہیں نیچے ان کے نہریں رہا کریں انہی میں ہمیشہ یہی ہے بڑی کامیابی';
    vtran(1343) := 'تو نہ کھڑا ہو اس میں کبھی البتہ وہ مسجد جسکی بنیاد دھری گئ پرہیزگاری پر اول دن سے وہ لائق ہے کہ تو کھڑا ہو اس میں، اس میں ایسے لوگ ہیں جو دوست رکھتے ہیں پاک رہنے کو اور اللہ دوست رکھتا ہے پاک رہنے والوں کو';
    vtran(2160) := 'وہ لوگ اگر خبر پالیں تمہاری پتھروں سے مار ڈالیں تم کو یا لوٹا لیں تم کو اپنے دین میں اور تب تو بھلا نہ ہو گا تمہارا کبھی';
    vtran(2175) := 'اور گیا اپنے باغ میں اور وہ برا کر رہا تھا اپنی جان پر بولا نہیں آتا مجھ کو خیال کہ خراب ہووے یہ باغ کبھی';
    vtran(2197) := 'اور اس سے زیادہ ظالم کون جس کو سمجھایا اسکے رب کے کلام سے پھر منہ پھیر لیا اسکی طرف سے اور بھول گیا جو کچھ آگے بھیج چکے ہیں اس کے ہاتھ ہم نے ڈال دیۓ ہیں انکے دلوں پر پردے کہ اس کو نہ سمجھیں اور انکے کانوں میں ہے بوجھ اور اگر تو ان کو بلاۓ راہ پر تو ہرگز نہ آئیں راہ پر اس وقت کبھی';
    vtran(2143) := 'جس میں رہا کریں ہمیشہ';
    vtran(4595) := 'کوئ نہیں تم نے تو خیال کیا تھا کہ پھر کر نہ آۓ گا رسول اور مسلمان اپنے گھر کبھی اور کھب گیا تمہارے دل میں یہ خیال اور اٹکل کی تم نے بری اٹکلیں اور تم لوگ تھے تباہ ہونے والے';
    vtran(5137) := 'کیا تو نے نہیں دیکھا ان لوگوں کو جو دغاباز ہیں کہتے ہیں اپنے بھائیوں کو کافر ہیں اہل کتاب میں سے اگر تم کو کوئ نکال دے گا تو ہم بھی نکلیں گے تمہارے ساتھ اور کہا نہ مانیں گے کسی کا تمہارے معاملہ میں کبھی اور اگر تم سے لڑائ ہوئ تو ہم تمہاری مدد کریں گے اور اللہ گواہی دیتا ہے کہ وہ جھوٹے ہیں';
    vtran(5154) := 'تم کو چال چلنی چاہئے اچھی ابراہیم کی اور جو اسکے ساتھ تھے جب انہوں نے کہا اپنی قوم کو ہم الگ ہیں تم سے اور ان سے کہ جنکو تم پوجتے ہو اللہ کے سواۓ ہم منکر ہوۓ تم سے اور کھل پڑی ہم میں اور تم میں دشمنی اور بیر ہمیشہ کو یہاں تک کہ تم یقین لاؤ اللہ اکیلے پر مگر ایک کہنا ابراہیم کا اپنے باپ کو کہ میں مانگوں گا معافی تیرے لۓ اور مالک نہیں میں تیرے نفع کا اللہ کے ہاتھ سے کسی چیز کا اے رب ہمارے ہم نے تجھ پر بھروسہ کیا اور تیری طرق رجوع ہوۓ اور تیری طرف ہے سب کو پھر آنا';
    vtran(5184) := 'اور وہ کبھی نہ منائیں گے اپنا مرنا ان کاموں کی وجہ سے جنکو آگے بھیج چکے ہیں انکے ہاتھ اور اللہ کو خوب معلوم ہیں سب گنہگار';
    vtran(5208) := 'جس دن تم کو اکٹھا کرے گا جمع ہونے کے دن وہ دن ہے ہار جیت کا اور جو کوئ یقین لاۓ اللہ پر اور کرے کام بھلا اتار دے گا اس پر سے اسکی برائیاں اور داخل کرے گا اسکو باغوں میں جنکے نیچے بہتی ہیں ندیاں رہا کریں ان میں ہمیشہ یہی ہے بڑی مراد ملتی ';
    vtran(550) := 'اور جو لوگ ایمان لاۓ اور کام کیۓ نیک البتہ انکو ہم داخل کریں گے باغوں میں جن کے نیچے بہتی ہیں نہریں رہا کریں ان میں ہمیشہ ان کے لۓ وہاں عورتیں ہیں ستھری اور انکو ہم داخل کریں گے گھنی چھاؤں میں';
    vtran(5228) := 'رسول ہے جو پڑھ کر سناتا ہے تم کو اللہ کی آیتیں کھول کر سنانے والی تاکہ نکالے ان لوگوں کو جو کہ یقین لاۓ اور کۓ بھلے کام اندھیروں سے اجالے میں اور جو کوئ یقین لاۓ اللہ پر اور کرے کچھ بھلائ اسکو داخل کرے باغوں میں نیچے بہتی ہیں جنکے نہریں سدا رہیں ان میں ہمیشہ البتہ خوب دی اللہ نے اسکو روزی';
    vtran(6138) := 'بدلا ان کا انکے رب کے یہاں باغ ہیں ہمیشہ رہنے کو نیچے بہتی ہیں انکے نہریں سدا رہیں ان میں ہمیشہ اللہ ان سے راضی اور وہ اس سے راضی یہ ملتا ہے اسکو جو ڈرا اپنے رب سے';
    vtran(3598) := 'رہا کریں اسی میں ہمیشہ نہ پائیں کوئ حمایتی اور نہ مددگار';
    vtran(2795) := 'اور جو لوگ عیب لگاتے ہیں حفاظت والیوں کو (پاکدامنوں کو) پھر نہ لاۓ چار مرد شاہد تو مارو ان کو اسی کوڑے اور نہ مانو ان کی گواہی کبھی اور وہی لوگ ہیں نافرمان';
    vtran(2808) := 'اللہ تم کو سمجھاتا ہے کہ پھر نہ کرو ایسا کام کبھی اگر تم ایمان رکھتے ہو';
    vtran(3586) := 'اے ایمان والو مت جاؤ نبی کے گھروں میں مگر جو تم کو حکم ہو کھانے کے واسطے نہ راہ دیکھنے والے اس کے پکنے کی لیکن جب تم کو بلاۓ تب جاؤ پھر جب کھا چکو تو آپ آپ کو چلے جاؤ اور نہ آپس میں جی لگا کر بیٹھو باتوں میں اس بات سے تمہاری تکلیف تھی نبی کو پھر تم سے شرم کرتا ہے اور اللہ شرم نہیں کرتا ٹھیک بات بتلانے میں اور جب مانگنے جاؤ بیبیوں سے کچھ چیز کام کی تو مانگ لو پردہ کے باہر سے اس میں خوب ستھرائ ہے تمھارے دل کو اور ان کے دل کو اور تم کو نہیں پہنچتا کہ تکلیف دو اللہ کے رسول کو اور نہ یہ کہ نکاح کرو اسکی عورتوں سے اس کے پیچھے کبھی البتہ یہ تمہاری بات اللہ کے یہاں بڑا گناہ ہے';
    vtran(5470) := 'مگر پہنچانا ہے اللہ کی طرف سے اور اکے پیغام لانے اور جو کوئ حکم نہ مانے اللہ کا اور اسکے رسول کا سو اسکے لۓ آگ ہے دوزخ کی رہا کریں اس میں ہمیشہ';
    vtran(131) := 'اور جب آزمایا ابراہیم کو اس کے رب نے کئ باتوں میں پھر اسنے وہ پوری کیں تب فرمایا میں تجھ کو کروں گا سب لوگوں کا پیشوا بولا اور میری اولاد میں سے بھی فرمایا نہیں پہنچے گا میرا قرار ظالموں کو';
    vtran(2638) := 'اور ابراہیم کی قوم اور لوط کی قوم';
    vtran(132) := 'اور جب مقرر کیا ہم نے خانہ کعبہ کو اجتماع کی جگہ لوگوں کے واسطے اور جگہ امن کی اور بناؤ ابراہیم کے کھڑے ہونے کی جگہ کو نماز کی جگہ اور حکم کیا ہم نے ابراہیم اور اسمعیل کو کہ پاک کر رکھو میرے گھر کو واسطے طواف کرنے والوں کے اور اعتکاف کرنے والوں کے اور رکوع اور سجدہ کرنے والوں کے';
    vtran(133) := 'اور جب کہا ابراہیم نے اے میرے رب بنا اس کو شہر امن کا اور روزی دے اسکے رہنے والوں کو میوے  جو کوئ ان میں سے ایمان لاوے اللہ پر اور قیامت کے دن پر فرمایا اور جو کفر کریں اس کو بھی نفع پہنچاؤں گا تھوڑے دونوں پھر اسکو جبراً بلاؤں گا دوزخ کے عزاب میں اور وہ بری جگہ ہے رہنے کی';
    vtran(134) := 'اور یاد کرو جب اٹھاتے تھے ابراہیم بنیادیں خانہ کعبہ کی اور اسمعیل اور دعا کرتے تھے اے پروردگار ہمارے قبول کر ہم سے بیشک تو ہی ہے سننے والا جاننے والا';
    vtran(137) := 'اور کون ہے جو پھرے ابراہیم کے مزہب سے مگر وہی کہ جس نے احمق بنایا اپنے آپ کو اور بیشک ہم نے انکو منتخب کیا دنیا میں اور وہ آخرت میں نیکوں میں ہیں';
    vtran(139) := 'اور یہی وصیت کر گیا ابراہیم اپنے بیٹوں کو اور یعقوب بھی کہ اے بیٹو بیشک اللہ نے چن کر دیا ہے تم کو دین سو تم ہرگز نہ مرنا مگر مسلمان';
    vtran(140) := 'کیا تم موجود تھے جس وقت  قریب آئ یعقوب کے موت جب کہا اپنے بیٹوں کو تم کس کی عبادت کرو گے میرے بعد بولے ہم بندگی کریں گے تیرے رب کی اور تیرے باپ دادوں کے رب کی ابراہیم اور اسمعیل اور اسحق ہیں وہی ایک معبود ہے اور ہم سب اسی کے فرمانبردار ہیں';
    vtran(142) := 'اور کہتے کہ ہو جاؤ یہودی یا نصرانی تو تم پالو گے راہ راست کہدے کہ ہرگز نہیں بلکہ ہم نے اختیار کی راہ ابراہیم کی جو ایک ہی طرف کا تھا اور نہ تھا شرک کرنے والوں میں';
    vtran(143) := 'تم کہہ دو کہ ہم ایمان لاۓ اللہ پر اور جو اترا ہم پر اور جو اترا ابراہیم اور اسمعیل اور اسحق اور یعقوب اور اس کی اولاد پر اور جو ملا موسی کو اور عیسی کو اور جو دوسرے پیغمبروں کو انکے رب کی طرف سے ہم فرق نہیں کرتے ان سب میں سے ایک میں بھی اور اسی پروردگار کے فرمانبردار ہیں';
    vtran(147) := 'کیا تم کہتے ہو کہ ابراہیم اور اسمعیل اور اسحق اور یعقوب اور اس کی اولاد تو یہودی تھے یا نصرانی کہدے کہ تم کو زیادہ خبر ہے یا اللہ کو اور اس سے بڑا ظالم کون جس نے چھپائ وہ گواہی جو ثابت ہو چکی اس کو اللہ کی طرف سے اور اللہ بیخبر نہیں تمھارے کاموں سے';
    vtran(265) := 'کیا نہ دیکھا تو نے اس شخص کو جس نے جگھڑا کیا ابراہیم سے اس رب کی بابت اسی وجہ سے کہ دی تھی اللہ نے اس کو سلطنت جب کہا ابراہیم نے میرا رب وہ ہے جو زندہ کرتا ہے اور مارتا ہے وہ بولا میں بھی جلاتا اور مارتا ہوں کہا ابراہیم نے کہ بیشک اللہ تو لاتا ہے سورج کو مشرق سے اب تو لے آ اس کو مغرب کی طرف سے تب حیران رہ گیا وہ کافر اور اللہ سیدھی راہ نہیں دکھاتا بے انصافوں کو';
    
    i := vtran.FIRST;
    WHILE i IS NOT NULL LOOP
        UPDATE ayat 
        SET translation_urdu = vtran(i)
        WHERE ayat_id = i;
        i := vtran.NEXT(i);
    END LOOP;
END;
/
/*Update Ayat with urdu translation */

DECLARE    
    TYPE t_tran IS TABLE OF VARCHAR2(2000) INDEX BY PLS_INTEGER;
    vtran t_tran;
    i NUMBER;
BEGIN
    /*Replace index by ayat_id and text by translation */
    i := vtran.FIRST;
    WHILE i IS NOT NULL LOOP
        --DBMS_OUTPUT.PUT_LINE (TO_CHAR(i)||': '||vtran(i));
        UPDATE ayat 
        SET translation_urdu = vtran(i)
        WHERE ayat_id = i;
        i := vtran.NEXT(i);
    END LOOP;
END;
/
COMMIT;