--set serveroutput on
/* Select Ayaat to update urdu translation */
SELECT a.ayat_id, a.ayat_text, a.translation_urdu 
FROM ayat a,
     soorah s
WHERE a.soorah_id = s.soorah_id 
AND soorah_seq_no = 2
AND ayat_seq_no >=21
AND ayat_seq_no <= 30;

/*Update Ayat with urdu translation */

DECLARE    
    TYPE t_tran IS TABLE OF VARCHAR2(2000) INDEX BY PLS_INTEGER;
    vtran t_tran;
    i NUMBER;
BEGIN
    /*Replace index by ayat_id and text by translation */
    vtran(1) := ('شروع اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے');
    vtran(2) := ('سب تعریفیں اللہ کے لۓ ہیں جو پالنے والا سارے جہاں کا');
    vtran(3) := ('بے حد مہربان نہایت رحم والا');
    vtran(4) := ('مالک روز جزا کا');
    vtran(5) := ('تیری ہی ہم بندگی کرتے ہیں اور تجھی سے مدد چاہتے ہیں');
    vtran(6) := ('بتلا ہم کو راہ سیدھی');
    vtran(7) := ('راہ ان لوگوں کی جن پر تو نے فضل فرمایا جن پر نہ تیرا غصہ ہوا اور نہ وہ گمراہ ہوۓ');
    vtran(8) := ('الم');
    vtran(9) := ('اس کتاب میں کوئ شک نہیں راہ بتلاتی ہے ڈرنے والوں کو');
    vtran(10) := ('جو کہ یقین کرتے ہیں بن دیکھی چیزوں کا اور قائم رکھتے ہیں نماز کو اور ہم نے روزی دی ہے ان کو اس میں سے خرچ کرتے ہیں');
    vtran(11) := ('اور وہ لوگ جو ایمان لاۓ اس پر کہ جو کچھ نازل ہوا تیری طرف اور اس پر کہ جو کچھ نازل ہوا تجھ سے پہلے اور آخرت کو وہ یقینی جانتے ہیں');
    vtran(12) := ('وہی لوگ ہیں ہدایت پر اپنے پروردگار کی طرف سے اور وہی ہیں مراد کو پہنچنے والے');
    vtran(13) := ('بیشک جو لوگ کافر ہو چکے برابر ہے ان کو تو ڈراۓ یا نہ ڈراۓ وہ ایمان نہ لائیں گے');
    vtran(14) := ('مہر کر دی اللہ نے ان کے دلوں پر اور ان کے کانوں پر اور ان کی آنکھوں پر پردہ ہے اور ان کے لۓ بڑا عذاب ہے');
    vtran(15) := ('اور لوگوں میں کچھ ایسے بھی ہیں جو کہتے ہیں ہم ایمان لاۓ اللہ پر اور دن قیامت پر اور وہ ہرگز مومن نہیں');
    vtran(16) := ('دغابازی کرتے ہیں اللہ سے اور ایمان والوں سے اور دراصل کسی کو دغا نہیں دیتے مگر اپنے آپ کو اور نہیں سوچتے');
    vtran(17) := ('ان کے دلوں میں بیماری ہے پھر بڑھا دی اللہ نے ان کی بیماری اور ان کے لۓ عذاب دردناک ہے اس بات پر کہ جھوٹ کہتے ہیں');
    vtran(18) := ('اور جب کہا جاتا ہے ان کو فساد نہ ڈالو ملک میں تو کہتے ہیں ہم تو اصلاح کرنے والے ہیں');
    vtran(19) := ('جان لو وہی ہیں خرابی کرنے والے لیکن نہیں سمچھتے');
    vtran(20) := ('اور جب کہا جاتا ہے ان کو ایمان لاؤ جس طرح ایمان لاۓ سب لوگ تو کہتے ہیں کیا ہم ایمان لائیں جس طرح ایمان لاۓ بیوقوف جان لو وہی ہیں بیوقوف لیکن نہیں جانتے');
    vtran(21) := ('اور جب ملاقات کرتے ہیں مسلمانوں سے تو کہتے ہیں ہم ایمان لے آۓ ہیں اور جب تنہا ہوتے ہیں اپنے شیطانوں کے پاس تو کہتے ہیں کہ بیشک ہم تمہارے ساتھ ہیں ہم تو ہنسی کرتے ہیں (يعنی مسلمانوں سے)');
    vtran(22) := ('اللہ ہنسی کرتا ہے ان سے اور ترقی دیتا ہے انکو ان کی سرکشی میں (اور) حالت یہ ہے کہ وہ عقل کے اندھے ہیں');
    vtran(23) := ('یہ وہی ہیں جنہوں نے مول لی گمراہی ہدایت کے بدلے سو نافع نہ ہوئ ان کی سوداگری اور نہ ہوۓ راہ پانے والے');
    vtran(24) := ('ان کی مثال اس شخص کی سی ہے جس نے آگ جلائی پھر جب روشن کر دیا آگ نے اس کے آس پاس کو تو زائل کر دی اللہ نے ان کی روشنی اور چھوڑا ان کو اندھیروں میں کہ کچھ نہیں دیکھتے');
    vtran(25) := ('بہرے ہیں گونگے ہیں اندھے ہیں سو وہ نہیں لوٹیں گے');
    vtran(26) := ('یا ان کی مثال ایسی ہے جیسے زور سے مینہ پڑ رہا ہو آسمان سے اس میں اندھیرے ہیں اور گرج اور بجلی دیتے ہیں انگلیاں اپنے کانوں میں مارے کڑک کے موت کے ڈر سے اور اللہ احاطہ کرنے والا ہے کافروں کا');
    vtran(27) := ('قریب ہے کہ بجلی اچک لے ان کی آنکھیں جب چمکتی ہے ان پر تو چلنے لگتے ہیں اس کی روشنی میں اور جب اندھیرا ہوتا ہے تو کھڑے رہ جاتے ہیں اور اگر چاہے اللہ تو لیجاۓ ان کے کان اور آنکھیں بیشک اللہ ہر چیز پر قادر ہے');
    vtran(28) := ('اے لوگو بندگی کرو اپنے رب کی جس نے پیدا کیا تم کو اور ان کو جو تم سے پہلے تھے تاکہ تم پرہیزگار بن جاؤ');
    vtran(29) := ('جس نے بنایا واسطے تمہارے زمین کو بچھونا اور آسمان کو چھت اور اتارا آسمان سے پانی پھر نکالے اس سے میوے تمھارے کھانے کے واسطے سو نہ ٹھراؤ کسی کو اللہ کے مقابل اور تم تو جانتے ہو');
    vtran(30) := ('اور اگر تم شک میں ہو اس کلام سے جو اتارا ہم نے اپنے بندے پر تو لے آؤ ایک سورت اس جیسی اور بلاؤ اس کو جو تمہارا مددگار ہو اللہ کے سوا اگر تم سچے ہو');
    vtran(31) := ('پھر اگر ایسا نہ کر سکو اور ہرگز نہ کر سکو گے تو ّپھر بچو اس آگ سے جس کا ایندھن آدمی اور پتھر ہیں تیار کی ہوئ ہے کافروں کے واسطے');
    vtran(32) := ('اور خشخبری دے ان لوگوں کو جو ایمان لاۓ اور اچھے کام کیۓ کہ ان کے واسطے باغ ہیں کہ بہتی ہیں ان کے نیچے نہریں جب ملے گا ان کو وہاں کا کوئ پھل کھانے کو تو کہیں گے یہ تو وہی ہے جو ملا تھا ہم کو اس سے پہلے اور دیۓ جائیں گے ان کو پھل ایک صورت کے اور ان کے لۓ وہاں عورتیں ہوں گی پاکیزہ اور وہ وہیں ہمیشہ رہیں گے');
    vtran(33) := ('بیشک اللہ شرماتا نہیں اس بات سے کہ بیان کرے کوئ مثال مچھر کی یا اس چیز کی جو اس سے بڑھ کر ہے سو جو لوگ مومن ہیں وہ یقیناً جانتے ہیں کہ یہ مثال ٹھیک ہے جو نازل ہوئ انکے رب کی طرف سے اور جو کافر ہیں سو کہتے ہیں کیا مطلب تھا اللہ کا اس مثال سے گمراہ کرتا ہے خداۓ تعالی اس مثال سے بہتیروں کو اور ہدایت کرتا ہے اس سے بہتیروں کو اور گمراہ نہیں کرتا اس مثل سے مگر بدکاروں کو');
    vtran(34) := ('جو توڑتے ہیں خدا کے معاہدے کو مضبوط کرنے کے بعد اور قطع کرتے ہیں اس چیز کو جس کو اللہ نے فرمایا ملانے کو اور فساد کرتے ہیں ملک میں وہی ہیں ٹوٹنے والے');
    vtran(35) := ('کس طرح کافر ہوتے ہو خداۓ تعالی سے حالانکہ تم بیجان تھے پھر جلایا تم کو پھر مارے گا تم کو پھر جلائے گا تم کو پھر اسی کی طرف لوٹاۓ جاؤ گے');
    vtran(36) := ('وہی ہے جس نے پیدا کیا تمہارے واسطے جو کچھ زمین میں ہے سب پھر قصد کیا آسمان کی طرف سو ٹھیک کر دیا انکو سات آسمان اور خدا تعالی ہر چیز سے خبردار ہے');
    vtran(37) := ('اور جب کہا تیرے رب نے فرشتوں کو کہ میں بنانیوالا ہوں زمین میں ایک نائب کہا فرشتوں نے کیا قائم کرتا ہے تو زمین میں اس کو جو فساد کرے اس میں اور خون بہاۓ اور ہم پڑھتے رہتے ہیں تیری خوبیاں اور یاد کرتے ہیں تیری پاک ذات کو فرمایا بیشک مجھ کو معلوم ہے جو تم نہیں جانتے');
    i := vtran.FIRST;
    WHILE i IS NOT NULL LOOP
        UPDATE ayat 
        SET translation_urdu = vtran(i)
        WHERE ayat_id = i;
        i := vtran.NEXT(i);
    END LOOP;
END;
/
/*Update Ayat with urdu translation */

DECLARE    
    TYPE t_tran IS TABLE OF VARCHAR2(2000) INDEX BY PLS_INTEGER;
    vtran t_tran;
    i NUMBER;
BEGIN
    /*Replace index by ayat_id and text by translation */
    vtran() := ('');
    vtran() := ('');
    i := vtran.FIRST;
    WHILE i IS NOT NULL LOOP
        --DBMS_OUTPUT.PUT_LINE (TO_CHAR(i)||': '||vtran(i));
        UPDATE ayat 
        SET translation_urdu = vtran(i)
        WHERE ayat_id = i;
        i := vtran.NEXT(i);
    END LOOP;
END;
/
COMMIT;